[
  {
    "Naruto Uzumaki": [
      {
        "opponent": "Neji Hyūga",
        "result": "win",
        "summary": "Chūnin Exams finals. Naruto overcame Neji's Gentle Fist using the Nine-Tails' chakra and won with an underground clone surprise attack, proving destiny can be changed.",
        "manga": "Chapters 100-105",
        "anime": "Episodes 60-62"
      },
      {
        "opponent": "Gaara",
        "result": "win",
        "summary": "During Konoha Crush, Naruto summoned Gamabunta to battle Gaara's Shukaku transformation. Naruto headbutted the awakened Gaara to win and changed his worldview.",
        "manga": "Chapters 131-138",
        "anime": "Episodes 78-80"
      },
      {
        "opponent": "Kiba Inuzuka",
        "result": "win",
        "summary": "Chūnin Exams preliminaries. Naruto accidentally won by passing gas, disrupting Kiba's enhanced senses, then defeated him with the Uzumaki Barrage.",
        "manga": "Chapters 75-76",
        "anime": "Episodes 43-44"
      },
      {
        "opponent": "Sasuke Uchiha",
        "result": "draw",
        "summary": "Final Valley battle. Naruto in One-Tail form clashed with Sasuke's Curse Mark Level 2. Their Rasengan and Chidori collided, but Sasuke left victorious yet spared Naruto's life.",
        "manga": "Chapters 228-234",
        "anime": "Episodes 128-134"
      },
      {
        "opponent": "Nagato",
        "result": "win",
        "summary": "Pain's Assault on Konoha. Naruto mastered Sage Mode to defeat the Six Paths of Pain, then convinced Nagato to revive those he killed through Talk no Jutsu.",
        "manga": "Chapters 430-449",
        "anime": "Episodes 163-175"
      },
      {
        "opponent": "Kakuzu",
        "result": "win",
        "summary": "Naruto debuted the Rasenshuriken, destroying two of Kakuzu's hearts and leaving him for Kakashi to finish. A major growth moment for Naruto.",
        "manga": "Chapters 339-342",
        "anime": "Episodes 87-88 (Shippūden)"
      },
      {
        "opponent": "A (Third Raikage)",
        "result": "win",
        "summary": "Fourth Shinobi War. Naruto used Sage Mode to redirect the Third Raikage's own Hell Stab technique against himself, exploiting the scar on his chest.",
        "manga": "Chapters 553-555",
        "anime": "Episodes 301-302 (Shippūden)"
      },
      {
        "opponent": "Obito Uchiha",
        "result": "win",
        "summary": "Naruto and the Allied Forces fought Obito as the Ten-Tails' jinchūriki. Naruto's words reached Obito, causing him to abandon his plan and help seal Kaguya.",
        "manga": "Chapters 636-651",
        "anime": "Episodes 378-387 (Shippūden)"
      },
      {
        "opponent": "Madara Uchiha",
        "result": "draw",
        "summary": "Fourth Shinobi War. Naruto with Six Paths Sage Mode fought Madara but couldn't defeat him before Madara activated the Infinite Tsukuyomi.",
        "manga": "Chapters 673-676",
        "anime": "Episodes 420-426 (Shippūden)"
      },
      {
        "opponent": "Kaguya Ōtsutsuki",
        "result": "win",
        "summary": "Naruto and Sasuke combined their Six Paths powers to seal Kaguya using the Six Paths — Chibaku Tensei, ending the Fourth Shinobi War.",
        "manga": "Chapters 679-690",
        "anime": "Episodes 458-479 (Shippūden)"
      },
      {
        "opponent": "Orochimaru",
        "result": "draw",
        "summary": "Multiple encounters. In Four-Tails form, Naruto nearly killed Orochimaru at the Tenchi Bridge, but Orochimaru escaped using substitution.",
        "manga": "Chapters 292-295",
        "anime": "Episodes 42-44 (Shippūden)"
      },
      {
        "opponent": "Kabuto Yakushi",
        "result": "draw",
        "summary": "After Tsunade search arc, Naruto hit Kabuto with a Rasengan but Kabuto's regeneration saved him. Both were incapacitated but survived.",
        "manga": "Chapters 166-170",
        "anime": "Episodes 94-96"
      },
      {
        "opponent": "Shino Aburame",
        "result": "win",
        "summary": "Training match where Naruto's massive chakra reserves and clones overwhelmed Shino's insect techniques.",
        "manga": "N/A (anime filler)",
        "anime": "Episode 148"
      },
      {
        "opponent": "Yamato",
        "result": "win",
        "summary": "During training, Naruto's Nine-Tails chakra erupted beyond Yamato's wood-style suppression abilities, requiring intervention.",
        "manga": "Chapters 291-296",
        "anime": "Episodes 40-45 (Shippūden)"
      },
      {
        "opponent": "Kakashi Hatake",
        "result": "draw",
        "summary": "Bell test rematch. Naruto and Sakura worked together against Kakashi and succeeded in taking a bell, proving their growth.",
        "manga": "Chapters 246-247",
        "anime": "Episodes 3-4 (Shippūden)"
      },
      {
        "opponent": "Killer B",
        "result": "draw",
        "summary": "Training session at Falls of Truth. Killer B helped Naruto master the Nine-Tails' chakra through intense sparring matches.",
        "manga": "Chapters 492-496",
        "anime": "Episodes 243-245 (Shippūden)"
      }
    ]
  },
  {
    "Sasuke Uchiha": [
      {
        "opponent": "Naruto Uzumaki",
        "result": "draw",
        "summary": "Final Valley battle. Sasuke's Chidori overpowered Naruto's Rasengan, but he chose not to kill his friend, abandoning his headband and leaving for Orochimaru.",
        "manga": "Chapters 228-234",
        "anime": "Episodes 128-134"
      },
      {
        "opponent": "Haku",
        "result": "draw",
        "summary": "Land of Waves. Sasuke awakened his Sharingan protecting Naruto from Haku's ice mirrors but was seemingly killed, triggering Naruto's Nine-Tails power.",
        "manga": "Chapters 27-31",
        "anime": "Episodes 17-19"
      },
      {
        "opponent": "Gaara",
        "result": "win",
        "summary": "Chūnin Exams finals. Sasuke debuted Chidori and pierced Gaara's sand armor, but the match was interrupted by the Konoha Crush invasion.",
        "manga": "Chapters 111-116",
        "anime": "Episodes 66-67"
      },
      {
        "opponent": "Orochimaru",
        "result": "lose",
        "summary": "Forest of Death. Orochimaru applied the Curse Mark to Sasuke after easily defeating him, beginning Sasuke's corruption.",
        "manga": "Chapters 48-52",
        "anime": "Episodes 28-30"
      },
      {
        "opponent": "Deidara",
        "result": "win",
        "summary": "Sasuke tracked Deidara after Itachi's trail. Using Sharingan genjutsu and Lightning Release to counter Deidara's explosives, Sasuke survived Deidara's suicide bombing.",
        "manga": "Chapters 357-362",
        "anime": "Episodes 123-124 (Shippūden)"
      },
      {
        "opponent": "Itachi Uchiha",
        "result": "lose",
        "summary": "Battle between brothers. Sasuke used all his techniques but Itachi, already dying from illness, let Sasuke win to transfer his powers and free him from Orochimaru.",
        "manga": "Chapters 384-394",
        "anime": "Episodes 134-143 (Shippūden)"
      },
      {
        "opponent": "Killer B",
        "result": "lose",
        "summary": "Taka attacked B to capture him for Akatsuki. B's Eight-Tails power overwhelmed the team, and B only pretended to be captured to escape Kumo.",
        "manga": "Chapters 408-418",
        "anime": "Episodes 142-143 (Shippūden)"
      },
      {
        "opponent": "A (Fourth Raikage)",
        "result": "draw",
        "summary": "Five Kage Summit. A attacked Sasuke for targeting his brother. Sasuke's Susanoo blocked A's attacks, but Gaara intervened before a conclusion.",
        "manga": "Chapters 461-464",
        "anime": "Episodes 202-204 (Shippūden)"
      },
      {
        "opponent": "Danzō Shimura",
        "result": "win",
        "summary": "Sasuke cornered Danzō to avenge the Uchiha clan. He broke through Izanagi and killed Danzō, who failed to take Sasuke with him using his suicide seal.",
        "manga": "Chapters 476-481",
        "anime": "Episodes 209-211 (Shippūden)"
      },
      {
        "opponent": "Kabuto Yakushi",
        "result": "win",
        "summary": "Itachi and Sasuke fought together against Kabuto's Sage Mode. Itachi used Izanami to trap Kabuto in a loop, forcing him to release the Edo Tensei.",
        "manga": "Chapters 579-588",
        "anime": "Episodes 333-339 (Shippūden)"
      },
      {
        "opponent": "Madara Uchiha",
        "result": "draw",
        "summary": "Fourth Shinobi War. Sasuke with Rinnegan fought Madara but couldn't prevent the Infinite Tsukuyomi's activation. Later cooperated against Kaguya.",
        "manga": "Chapters 673-676",
        "anime": "Episodes 420-426 (Shippūden)"
      },
      {
        "opponent": "Kaguya Ōtsutsuki",
        "result": "win",
        "summary": "Sasuke and Naruto used Six Paths powers to seal Kaguya. Sasuke's Rinnegan dimension-shifting was crucial to the final sealing.",
        "manga": "Chapters 679-690",
        "anime": "Episodes 458-479 (Shippūden)"
      },
      {
        "opponent": "Rock Lee",
        "result": "lose",
        "summary": "Before Chūnin Exams. Rock Lee challenged Sasuke and easily outpaced his Sharingan with pure taijutsu speed, humbling the Uchiha prodigy.",
        "manga": "Chapters 37-38",
        "anime": "Episode 22"
      },
      {
        "opponent": "Sai",
        "result": "win",
        "summary": "Orochimaru's hideout. Sasuke easily overwhelmed Sai with his superior speed and power, demonstrating his growth under Orochimaru.",
        "manga": "Chapters 303-308",
        "anime": "Episodes 51-52 (Shippūden)"
      },
      {
        "opponent": "Yamato",
        "result": "win",
        "summary": "Orochimaru's hideout. Sasuke's Chidori current paralyzed the entire Team Kakashi including Yamato, showing his overwhelming power.",
        "manga": "Chapters 306-309",
        "anime": "Episodes 51-54 (Shippūden)"
      }
    ]
  },
  {
    "Sakura Haruno": [
      {
        "opponent": "Ino Yamanaka",
        "result": "draw",
        "summary": "Chūnin Exams preliminaries. Childhood rivals fought to mutual knockout. Both put everything into final punches that connected simultaneously.",
        "manga": "Chapters 71-73",
        "anime": "Episodes 41-42"
      },
      {
        "opponent": "Sasori",
        "result": "win",
        "summary": "Sakura and Chiyo fought Sasori in his Akatsuki hideout. Sakura's antidotes and superhuman strength helped defeat the puppet master, with Sasori allowing his death.",
        "manga": "Chapters 264-278",
        "anime": "Episodes 20-27 (Shippūden)"
      }
    ]
  },
  {
    "Kakashi Hatake": [
      {
        "opponent": "Zabuza Momochi",
        "result": "win",
        "summary": "First major fight of the series. Kakashi copied Zabuza's techniques and trapped him with the Water Dragon Jutsu, later killing him on the bridge.",
        "manga": "Chapters 12-33",
        "anime": "Episodes 7-19"
      },
      {
        "opponent": "Itachi Uchiha",
        "result": "lose",
        "summary": "Itachi's return to Konoha. Kakashi was caught in Tsukuyomi and experienced 72 hours of torture in seconds, requiring weeks of recovery.",
        "manga": "Chapters 142-146",
        "anime": "Episodes 82-85"
      },
      {
        "opponent": "Kakuzu",
        "result": "draw",
        "summary": "Kakashi pierced one of Kakuzu's hearts with Lightning Blade but was overwhelmed by his multiple hearts until Naruto arrived.",
        "manga": "Chapters 333-342",
        "anime": "Episodes 85-88 (Shippūden)"
      },
      {
        "opponent": "Nagato",
        "result": "lose",
        "summary": "Pain's Assault. Kakashi fought the Deva Path to protect Chōji but died using Kamui to save Chōji from a missile, later revived by Nagato.",
        "manga": "Chapters 421-425",
        "anime": "Episodes 158-159 (Shippūden)"
      },
      {
        "opponent": "Obito Uchiha",
        "result": "win",
        "summary": "Former teammates battled in the Kamui dimension. Kakashi stabbed Obito through the heart, winning their emotional confrontation over ideals.",
        "manga": "Chapters 608-609, 636",
        "anime": "Episodes 375-386 (Shippūden)"
      },
      {
        "opponent": "Kaguya Ōtsutsuki",
        "result": "win",
        "summary": "Obito gave Kakashi both his Sharingan before dying. Kakashi manifested Perfect Susanoo and helped Team 7 seal Kaguya.",
        "manga": "Chapters 688-690",
        "anime": "Episodes 473-479 (Shippūden)"
      },
      {
        "opponent": "Haku",
        "result": "win",
        "summary": "Kakashi's Lightning Blade killed Haku, who jumped in front of Zabuza to take the fatal blow meant for his master.",
        "manga": "Chapters 29-32",
        "anime": "Episodes 18-19"
      },
      {
        "opponent": "Kisame Hoshigaki",
        "result": "draw",
        "summary": "Itachi and Kisame confronted Kakashi in Konoha. Might Guy arrived before a real battle developed, causing them to retreat.",
        "manga": "Chapters 142-146",
        "anime": "Episodes 82-85"
      },
      {
        "opponent": "Deidara",
        "result": "draw",
        "summary": "Kakashi used Kamui to warp away Deidara's explosive clay, losing his arm. The fight was interrupted before conclusion.",
        "manga": "Chapters 276-280",
        "anime": "Episodes 29-32 (Shippūden)"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "draw",
        "summary": "Bell test rematch. Kakashi tested Naruto and Sakura's growth, and they successfully worked together to claim the bells.",
        "manga": "Chapters 246-247",
        "anime": "Episodes 3-4 (Shippūden)"
      }
    ]
  },
  {
    "Might Guy": [
      {
        "opponent": "Kisame Hoshigaki",
        "result": "win",
        "summary": "Guy used the Seventh Gate to defeat Kisame's Samehada fusion form with Hirudora, avenging their previous encounters.",
        "manga": "Chapters 506-508",
        "anime": "Episodes 250-251 (Shippūden)"
      },
      {
        "opponent": "Madara Uchiha",
        "result": "win",
        "summary": "Guy opened all Eight Gates to fight Ten-Tails Madara. His Night Guy technique nearly killed Madara, who called him the strongest taijutsu user.",
        "manga": "Chapters 668-672",
        "anime": "Episodes 418-420 (Shippūden)"
      },
      {
        "opponent": "Kakashi Hatake",
        "result": "draw",
        "summary": "Eternal rivals with 50-49 record. Their competitions range from rock-paper-scissors to racing, never having a decisive combat victory.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      },
      {
        "opponent": "Rock Lee",
        "result": "win",
        "summary": "Guy trained Lee personally, always remaining one step ahead as his master while teaching him the Eight Gates technique.",
        "manga": "Various chapters",
        "anime": "Episode 196"
      },
      {
        "opponent": "Neji Hyūga",
        "result": "draw",
        "summary": "As Team Guy's sensei, Guy trained alongside Neji but never had a definitive battle, respecting each other's styles.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      },
      {
        "opponent": "Tenten",
        "result": "win",
        "summary": "Training sessions where Guy's taijutsu mastery always overcame Tenten's weapons expertise.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      }
    ]
  },
  {
    "Rock Lee": [
      {
        "opponent": "Sasuke Uchiha",
        "result": "win",
        "summary": "Pre-Chūnin Exams challenge. Lee's speed overwhelmed Sasuke's Sharingan completely, only stopped by Guy before using forbidden techniques.",
        "manga": "Chapters 37-38",
        "anime": "Episode 22"
      },
      {
        "opponent": "Gaara",
        "result": "lose",
        "summary": "Chūnin Exams preliminaries. Lee opened Five Gates and nearly won with Primary Lotus and Hidden Lotus, but Gaara's sand crushed his arm and leg.",
        "manga": "Chapters 82-86",
        "anime": "Episodes 48-50"
      },
      {
        "opponent": "Kimimaro",
        "result": "lose",
        "summary": "Sasuke Retrieval arc. Lee fought while still recovering and intoxicated on medicine. Kimimaro's bone techniques overwhelmed him until Gaara arrived.",
        "manga": "Chapters 210-216",
        "anime": "Episodes 123-127"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "draw",
        "summary": "Friendly sparring matches where both pushed each other. Neither achieved a decisive victory in their training battles.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      },
      {
        "opponent": "Neji Hyūga",
        "result": "lose",
        "summary": "Academy and team sparring. Neji's Gentle Fist and Byakugan gave him consistent advantages over Lee in their training matches.",
        "manga": "Various chapters",
        "anime": "Episode 193"
      },
      {
        "opponent": "Tenten",
        "result": "win",
        "summary": "Team Guy training. Lee's close-combat taijutsu overcame Tenten's ranged weapons style in their sparring sessions.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      }
    ]
  },
  {
    "Neji Hyūga": [
      {
        "opponent": "Hinata Hyūga",
        "result": "win",
        "summary": "Chūnin Exams preliminaries. Neji brutally defeated his cousin, nearly killing her while ranting about destiny and the Branch Family's fate.",
        "manga": "Chapters 78-80",
        "anime": "Episodes 46-47"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "lose",
        "summary": "Chūnin Exams finals. Despite dominating early, Naruto's Nine-Tails chakra and underground clone attack defeated Neji, changing his worldview.",
        "manga": "Chapters 100-105",
        "anime": "Episodes 60-62"
      },
      {
        "opponent": "Kidōmaru",
        "result": "win",
        "summary": "Sasuke Retrieval arc. Neji figured out Kidōmaru's spider techniques and survived a nearly fatal arrow wound to deliver the killing blow.",
        "manga": "Chapters 192-199",
        "anime": "Episodes 114-117"
      },
      {
        "opponent": "Rock Lee",
        "result": "win",
        "summary": "Team training and Academy sparring. Neji's Byakugan and Gentle Fist gave him advantages in most matches against Lee.",
        "manga": "Various chapters",
        "anime": "Episode 193"
      },
      {
        "opponent": "Tenten",
        "result": "win",
        "summary": "Team training where Neji's Rotation deflected Tenten's weapons and his Gentle Fist closed the distance effectively.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      }
    ]
  },
  {
    "Gaara": [
      {
        "opponent": "Rock Lee",
        "result": "win",
        "summary": "Chūnin Exams preliminaries. Despite Lee's incredible speed with the Gates, Gaara's sand armor and Shield of Sand prevailed, crushing Lee's limbs.",
        "manga": "Chapters 82-86",
        "anime": "Episodes 48-50"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "lose",
        "summary": "Konoha Crush. Naruto summoned Gamabunta to fight Shukaku and headbutted Gaara awake, defeating him and changing his heart through understanding.",
        "manga": "Chapters 131-138",
        "anime": "Episodes 78-80"
      },
      {
        "opponent": "Deidara",
        "result": "lose",
        "summary": "Deidara attacked Suna to capture Gaara. Gaara protected the village but lost consciousness blocking a massive explosion. Akatsuki extracted Shukaku.",
        "manga": "Chapters 248-261",
        "anime": "Episodes 2-17 (Shippūden)"
      },
      {
        "opponent": "Kimimaro",
        "result": "win",
        "summary": "Sasuke Retrieval arc. Gaara arrived to save Lee and trapped Kimimaro, who died from his illness just before delivering a fatal blow.",
        "manga": "Chapters 214-217",
        "anime": "Episodes 126-127"
      },
      {
        "opponent": "Gengetsu Hōzuki",
        "result": "draw",
        "summary": "Fourth Shinobi War. Gaara sealed the Edo Tensei Second Mizukage after an extended battle exploiting his giant clam genjutsu weakness.",
        "manga": "Chapters 556-558",
        "anime": "Episodes 302-305 (Shippūden)"
      },
      {
        "opponent": "Sasuke Uchiha",
        "result": "draw",
        "summary": "Chūnin Exams finals. Sasuke's Chidori pierced Gaara's sand, but the invasion interrupted before a true conclusion.",
        "manga": "Chapters 111-116",
        "anime": "Episodes 66-67"
      }
    ]
  },
  {
    "Shikamaru Nara": [
      {
        "opponent": "Hidan",
        "result": "win",
        "summary": "Revenge for Asuma. Shikamaru trapped Hidan with explosive tags and shadow techniques, burying him alive in the Nara forest forever.",
        "manga": "Chapters 333-339",
        "anime": "Episodes 85-87 (Shippūden)"
      },
      {
        "opponent": "Tayuya",
        "result": "win",
        "summary": "Sasuke Retrieval arc. Shikamaru's Shadow Possession trapped Tayuya, but Temari arrived to finish her with Summoning: Quick Beheading Dance.",
        "manga": "Chapters 203-207",
        "anime": "Episodes 119-121"
      },
      {
        "opponent": "Temari",
        "result": "lose",
        "summary": "Chūnin Exams finals. Shikamaru strategically outmaneuvered Temari but forfeited due to low chakra, despite having her trapped.",
        "manga": "Chapters 107-108",
        "anime": "Episode 64"
      }
    ]
  },
  {
    "Choji Akimichi": [
      {
        "opponent": "Jirōbō",
        "result": "win",
        "summary": "Sasuke Retrieval arc. Choji used the three colored pills, transforming into Butterfly Mode to kill Jirōbō with Butterfly Bullet Bombing.",
        "manga": "Chapters 186-191",
        "anime": "Episodes 112-114"
      },
      {
        "opponent": "Kakuzu",
        "result": "draw",
        "summary": "Choji's expansion techniques helped distract Kakuzu but couldn't damage him significantly before Naruto's arrival.",
        "manga": "Chapters 333-336",
        "anime": "Episodes 85-86 (Shippūden)"
      },
      {
        "opponent": "Asuma Sarutobi",
        "result": "lose",
        "summary": "Fourth Shinobi War. Edo Tensei Asuma fought his students. Choji couldn't attack his sensei until Asuma's words freed him to use Butterfly Mode.",
        "manga": "Chapters 529-533",
        "anime": "Episodes 272-274 (Shippūden)"
      }
    ]
  },
  {
    "Ino Yamanaka": [
      {
        "opponent": "Sakura Haruno",
        "result": "draw",
        "summary": "Chūnin Exams preliminaries. Former best friends clashed with everything they had, knocking each other out simultaneously.",
        "manga": "Chapters 71-73",
        "anime": "Episodes 41-42"
      },
      {
        "opponent": "Sai",
        "result": "draw",
        "summary": "Team dynamics and training. Ino and Sai developed a relationship through missions rather than combat.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      },
      {
        "opponent": "Kakuzu",
        "result": "draw",
        "summary": "Ino provided support during the Team 10 battle against Kakuzu, using Mind Transfer for reconnaissance rather than direct combat.",
        "manga": "Chapters 333-336",
        "anime": "Episodes 85-86 (Shippūden)"
      }
    ]
  },
  {
    "Hinata Hyūga": [
      {
        "opponent": "Neji Hyūga",
        "result": "lose",
        "summary": "Chūnin Exams preliminaries. Neji's hatred of the Main Family drove him to nearly kill Hinata despite her brave refusal to give up.",
        "manga": "Chapters 78-80",
        "anime": "Episodes 46-47"
      },
      {
        "opponent": "Nagato",
        "result": "lose",
        "summary": "Pain's Assault. Hinata confessed her love to Naruto and attacked Pain to protect him, but was easily defeated and nearly killed.",
        "manga": "Chapters 437-438",
        "anime": "Episode 166 (Shippūden)"
      }
    ]
  },
  {
    "Kiba Inuzuka": [
      {
        "opponent": "Naruto Uzumaki",
        "result": "lose",
        "summary": "Chūnin Exams preliminaries. Kiba underestimated Naruto, who accidentally used flatulence to disrupt Kiba's senses and won with Uzumaki Barrage.",
        "manga": "Chapters 75-76",
        "anime": "Episodes 43-44"
      },
      {
        "opponent": "Sakon and Ukon",
        "result": "lose",
        "summary": "Sasuke Retrieval arc. Kiba and Akamaru nearly died fighting the twin brothers until Kankurō arrived with his puppets.",
        "manga": "Chapters 200-206",
        "anime": "Episodes 118-121"
      },
      {
        "opponent": "Sakura Haruno",
        "result": "draw",
        "summary": "Training and team exercises where neither decisively defeated the other.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      }
    ]
  },
  {
    "Shino Aburame": [
      {
        "opponent": "Kankurō",
        "result": "win",
        "summary": "Chūnin Exams finals. Shino's bugs infiltrated Kankurō's puppets and body, forcing him to forfeit before being consumed.",
        "manga": "Chapter 125",
        "anime": "Episode 75"
      }
    ]
  },
  {
    "Tenten": [
      {
        "opponent": "Temari",
        "result": "lose",
        "summary": "Chūnin Exams preliminaries. Temari's wind techniques completely countered Tenten's weapons, defeating her without taking any damage.",
        "manga": "Chapter 73",
        "anime": "Episode 43"
      },
      {
        "opponent": "Kakuzu",
        "result": "draw",
        "summary": "Fourth Shinobi War. Tenten used the Treasured Tools of the Sage of Six Paths against Kakuzu's Edo Tensei, providing support.",
        "manga": "Chapters 524-528",
        "anime": "Episodes 267-269 (Shippūden)"
      }
    ]
  },
  {
    "Kurenai Yūhi": [
      {
        "opponent": "Itachi Uchiha",
        "result": "lose",
        "summary": "Itachi's return to Konoha. Kurenai tried genjutsu on Itachi, who instantly reversed it, nearly killing her before Kakashi intervened.",
        "manga": "Chapters 142-143",
        "anime": "Episode 82"
      },
      {
        "opponent": "Kisame Hoshigaki",
        "result": "draw",
        "summary": "Confrontation alongside Asuma. They stalled the Akatsuki duo until Guy arrived, avoiding direct combat with Kisame.",
        "manga": "Chapters 142-143",
        "anime": "Episode 82"
      }
    ]
  },
  {
    "Asuma Sarutobi": [
      {
        "opponent": "Itachi Uchiha",
        "result": "lose",
        "summary": "Itachi's return to Konoha. Asuma fought alongside Kurenai but they were outmatched by Itachi's Sharingan abilities.",
        "manga": "Chapters 142-143",
        "anime": "Episode 82"
      },
      {
        "opponent": "Kisame Hoshigaki",
        "result": "draw",
        "summary": "Asuma's chakra blades clashed with Samehada, but Guy arrived before the fight could conclude.",
        "manga": "Chapters 142-143",
        "anime": "Episode 82"
      },
      {
        "opponent": "Kakuzu",
        "result": "lose",
        "summary": "Akatsuki Suppression arc. Asuma was overwhelmed by Kakuzu's multiple hearts and elemental techniques.",
        "manga": "Chapters 323-328",
        "anime": "Episodes 78-80 (Shippūden)"
      },
      {
        "opponent": "Hidan",
        "result": "lose",
        "summary": "Akatsuki Suppression arc. Hidan's curse ritual killed Asuma after ingesting his blood, dying with final words to his students.",
        "manga": "Chapters 323-328",
        "anime": "Episodes 78-80 (Shippūden)"
      }
    ]
  },
  {
    "Yamato": [
      {
        "opponent": "Sasuke Uchiha",
        "result": "lose",
        "summary": "Orochimaru's hideout. Yamato was paralyzed by Sasuke's Chidori current along with the rest of Team Kakashi.",
        "manga": "Chapters 306-309",
        "anime": "Episodes 51-54 (Shippūden)"
      },
      {
        "opponent": "Kabuto Yakushi",
        "result": "draw",
        "summary": "Multiple encounters. Yamato's Wood Release clashed with Kabuto's regeneration abilities without decisive victory.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "draw",
        "summary": "Yamato suppressed Naruto's Nine-Tails during training but couldn't fully control the Four-Tails transformation.",
        "manga": "Chapters 291-296",
        "anime": "Episodes 40-45 (Shippūden)"
      },
      {
        "opponent": "Sai",
        "result": "draw",
        "summary": "Team dynamics where Yamato led rather than fought against Sai.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      }
    ]
  },
  {
    "Sai": [
      {
        "opponent": "Sasuke Uchiha",
        "result": "lose",
        "summary": "Orochimaru's hideout. Sai attempted to complete his mission but was defeated by Sasuke's overwhelming power.",
        "manga": "Chapters 303-308",
        "anime": "Episodes 51-52 (Shippūden)"
      },
      {
        "opponent": "Deidara",
        "result": "draw",
        "summary": "Sai's ink birds pursued Deidara during the Gaara rescue, providing reconnaissance rather than engaging directly.",
        "manga": "Chapters 276-278",
        "anime": "Episodes 29-30 (Shippūden)"
      },
      {
        "opponent": "Sasori",
        "result": "draw",
        "summary": "Sai encountered Sasori's techniques during missions but had limited direct combat.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      },
      {
        "opponent": "Yamato",
        "result": "draw",
        "summary": "Team leadership dynamics rather than actual combat between them.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      },
      {
        "opponent": "Ino Yamanaka",
        "result": "draw",
        "summary": "Romantic relationship development rather than combat encounters.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      }
    ]
  },
  {
    "Jiraiya": [
      {
        "opponent": "Orochimaru",
        "result": "draw",
        "summary": "Multiple encounters as former teammates. Their Sannin battle left Jiraiya with a scar across his chest from Orochimaru's sword.",
        "manga": "Chapters 163-170",
        "anime": "Episodes 94-96"
      },
      {
        "opponent": "Tsunade",
        "result": "draw",
        "summary": "Legendary Sannin never had decisive combat. Their confrontation during Tsunade's recruitment was brief.",
        "manga": "Chapters 154-160",
        "anime": "Episodes 89-91"
      },
      {
        "opponent": "Itachi Uchiha",
        "result": "draw",
        "summary": "Itachi and Kisame retreated when Jiraiya arrived in Konoha, avoiding direct confrontation with the Sannin.",
        "manga": "Chapters 144-148",
        "anime": "Episodes 84-85"
      },
      {
        "opponent": "Nagato",
        "result": "lose",
        "summary": "Jiraiya infiltrated Rain Village and fought the Six Paths of Pain. He discovered Pain's secret but was killed, writing a coded message on Fukasaku.",
        "manga": "Chapters 369-383",
        "anime": "Episodes 127-133 (Shippūden)"
      },
      {
        "opponent": "Hanzō",
        "result": "draw",
        "summary": "Second Shinobi War. The three Sannin survived against Hanzō, earning their title. Hanzō spared them impressed by their strength.",
        "manga": "Chapter 369",
        "anime": "Episode 128 (Shippūden)"
      }
    ]
  },
  {
    "Orochimaru": [
      {
        "opponent": "Hiruzen Sarutobi",
        "result": "win",
        "summary": "Konoha Crush. Orochimaru killed his teacher with the Reaper Death Seal taking both their souls, though Hiruzen sealed Orochimaru's arms.",
        "manga": "Chapters 120-138",
        "anime": "Episodes 71-80"
      },
      {
        "opponent": "Jiraiya",
        "result": "draw",
        "summary": "Multiple encounters as rivals. Their Sannin battle left lasting scars on both, neither achieving decisive victory.",
        "manga": "Chapters 163-170",
        "anime": "Episodes 94-96"
      },
      {
        "opponent": "Tsunade",
        "result": "draw",
        "summary": "Sannin showdown. Orochimaru couldn't defeat Tsunade despite her fear of blood, and retreated when Jiraiya joined.",
        "manga": "Chapters 163-170",
        "anime": "Episodes 94-96"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "draw",
        "summary": "Tenchi Bridge. Orochimaru faced Naruto's Four-Tails form and was nearly killed but escaped using substitution.",
        "manga": "Chapters 292-295",
        "anime": "Episodes 42-44 (Shippūden)"
      },
      {
        "opponent": "Sasuke Uchiha",
        "result": "lose",
        "summary": "Sasuke absorbed Orochimaru when Orochimaru attempted the body transfer, claiming his powers for himself.",
        "manga": "Chapters 344-346",
        "anime": "Episodes 113-114 (Shippūden)"
      },
      {
        "opponent": "Itachi Uchiha",
        "result": "lose",
        "summary": "Orochimaru tried to steal Itachi's body but was trapped in genjutsu instantly. Itachi severed his hand, forcing his departure from Akatsuki.",
        "manga": "Chapters 345-346",
        "anime": "Episode 114 (Shippūden)"
      },
      {
        "opponent": "Kabuto Yakushi",
        "result": "lose",
        "summary": "Kabuto absorbed Orochimaru's remains and consciousness, becoming the dominant personality in their merged form.",
        "manga": "Chapters 356-358",
        "anime": "Episodes 113-115 (Shippūden)"
      },
      {
        "opponent": "Anko Mitarashi",
        "result": "win",
        "summary": "Orochimaru defeated his former student with ease, her Curse Mark being a fraction of his power.",
        "manga": "Chapters 49-51",
        "anime": "Episodes 29-30"
      }
    ]
  },
  {
    "Tsunade": [
      {
        "opponent": "Orochimaru",
        "result": "draw",
        "summary": "Sannin showdown. Tsunade overcame her hemophobia to protect Naruto and fought Orochimaru until he retreated.",
        "manga": "Chapters 163-170",
        "anime": "Episodes 94-96"
      },
      {
        "opponent": "Kabuto Yakushi",
        "result": "win",
        "summary": "Tsunade used her medical knowledge to adapt to Kabuto's attacks and defeated him with her superhuman strength.",
        "manga": "Chapters 163-170",
        "anime": "Episodes 94-96"
      },
      {
        "opponent": "Madara Uchiha",
        "result": "lose",
        "summary": "Five Kage Summit. Madara's Perfect Susanoo overwhelmed all Five Kage. Tsunade was bisected but survived through Byakugō.",
        "manga": "Chapters 577-589",
        "anime": "Episodes 322-334 (Shippūden)"
      },
      {
        "opponent": "Jiraiya",
        "result": "draw",
        "summary": "Sannin never had serious combat against each other, maintaining their bond as teammates.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      },
      {
        "opponent": "Nagato",
        "result": "draw",
        "summary": "Fourth Shinobi War. Tsunade and the Kage fought Edo Tensei Madara, not directly confronting Nagato.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      }
    ]
  },
  {
    "Itachi Uchiha": [
      {
        "opponent": "Kakashi Hatake",
        "result": "win",
        "summary": "Konoha infiltration. Itachi trapped Kakashi in Tsukuyomi, torturing him for 72 hours in seconds and incapacitating him for weeks.",
        "manga": "Chapters 142-146",
        "anime": "Episodes 82-85"
      },
      {
        "opponent": "Kurenai Yūhi",
        "result": "win",
        "summary": "Itachi instantly reversed Kurenai's genjutsu, demonstrating his absolute mastery of the art.",
        "manga": "Chapters 142-143",
        "anime": "Episode 82"
      },
      {
        "opponent": "Asuma Sarutobi",
        "result": "win",
        "summary": "Konoha infiltration. Asuma and Kurenai were no match for Itachi's Sharingan abilities.",
        "manga": "Chapters 142-143",
        "anime": "Episode 82"
      },
      {
        "opponent": "Jiraiya",
        "result": "draw",
        "summary": "Itachi and Kisame retreated rather than fight Jiraiya, acknowledging the Sannin's power.",
        "manga": "Chapters 144-148",
        "anime": "Episodes 84-85"
      },
      {
        "opponent": "Sasuke Uchiha",
        "result": "win",
        "summary": "Itachi fought Sasuke at the Uchiha hideout. Already dying, he let Sasuke win to free him from the Curse Mark and transfer Amaterasu.",
        "manga": "Chapters 384-394",
        "anime": "Episodes 134-143 (Shippūden)"
      },
      {
        "opponent": "Orochimaru",
        "result": "win",
        "summary": "When Orochimaru tried to steal his body, Itachi severed his hand and trapped him in genjutsu, forcing him out of Akatsuki.",
        "manga": "Chapters 345-346",
        "anime": "Episode 114 (Shippūden)"
      },
      {
        "opponent": "Kabuto Yakushi",
        "result": "win",
        "summary": "Edo Tensei Itachi used Izanami to trap Kabuto in a loop, forcing him to release the technique and accept himself.",
        "manga": "Chapters 579-588",
        "anime": "Episodes 333-339 (Shippūden)"
      },
      {
        "opponent": "Deidara",
        "result": "win",
        "summary": "Deidara's hatred for Itachi stemmed from losing to his genjutsu, which made his artistic explosions completely ineffective.",
        "manga": "Chapter 360",
        "anime": "Episode 124 (Shippūden)"
      }
    ]
  },
  {
    "Kisame Hoshigaki": [
      {
        "opponent": "Asuma Sarutobi",
        "result": "draw",
        "summary": "Konoha infiltration. Brief clash of Asuma's chakra blades versus Samehada before Guy's arrival.",
        "manga": "Chapters 142-143",
        "anime": "Episode 82"
      },
      {
        "opponent": "Might Guy",
        "result": "lose",
        "summary": "Kisame fell to Guy's Hirudora technique after fusing with Samehada. Earlier encounters also favored Guy.",
        "manga": "Chapters 506-508",
        "anime": "Episodes 250-251 (Shippūden)"
      },
      {
        "opponent": "Killer B",
        "result": "lose",
        "summary": "Kisame was decapitated by B's Lariat, though it was revealed to be a clone. Later captured for intelligence.",
        "manga": "Chapters 470-473",
        "anime": "Episodes 206-207 (Shippūden)"
      },
      {
        "opponent": "Itachi Uchiha",
        "result": "draw",
        "summary": "Partners in Akatsuki. Kisame respected Itachi deeply and never fought him seriously.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      },
      {
        "opponent": "Kakashi Hatake",
        "result": "draw",
        "summary": "Brief encounter in Konoha where they retreated before fighting seriously.",
        "manga": "Chapters 142-146",
        "anime": "Episodes 82-85"
      }
    ]
  },
  {
    "Deidara": [
      {
        "opponent": "Gaara",
        "result": "win",
        "summary": "Deidara attacked Sunagakure and defeated Gaara by exploiting his duty to protect the village. Gaara sacrificed himself to block a massive explosion.",
        "manga": "Chapters 248-261",
        "anime": "Episodes 2-17 (Shippūden)"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "draw",
        "summary": "Gaara rescue mission. Naruto and Kakashi pursued Deidara but he escaped using a suicide clone.",
        "manga": "Chapters 276-280",
        "anime": "Episodes 29-32 (Shippūden)"
      },
      {
        "opponent": "Sasuke Uchiha",
        "result": "lose",
        "summary": "Deidara's art was countered by Sasuke's Lightning Release and Sharingan. In desperation, Deidara used C0 suicide bombing, but Sasuke survived.",
        "manga": "Chapters 357-362",
        "anime": "Episodes 123-124 (Shippūden)"
      },
      {
        "opponent": "Itachi Uchiha",
        "result": "lose",
        "summary": "Deidara was recruited to Akatsuki after losing to Itachi's genjutsu, sparking his hatred for the Sharingan.",
        "manga": "Chapter 360",
        "anime": "Episode 124 (Shippūden)"
      },
      {
        "opponent": "Han",
        "result": "win",
        "summary": "Deidara captured the Five-Tails jinchūriki Han for Akatsuki using his explosive clay techniques.",
        "manga": "Chapter 420",
        "anime": "N/A (mentioned only)"
      }
    ]
  },
  {
    "Sasori": [
      {
        "opponent": "Sakura Haruno",
        "result": "lose",
        "summary": "Sakura and Chiyo fought Sasori in his hideout. Despite his 100 puppet army, they destroyed his core. Sasori allowed his death, choosing to join his parents.",
        "manga": "Chapters 264-278",
        "anime": "Episodes 20-27 (Shippūden)"
      },
      {
        "opponent": "Kankurō",
        "result": "win",
        "summary": "Sasori easily defeated Kankurō during the Gaara rescue, poisoning him with techniques Kankurō couldn't match.",
        "manga": "Chapters 253-256",
        "anime": "Episodes 6-8 (Shippūden)"
      },
      {
        "opponent": "Chiyo",
        "result": "lose",
        "summary": "Sasori's grandmother Chiyo, with Sakura's help, managed to destroy his puppet body. Sasori chose not to dodge the final blow.",
        "manga": "Chapters 264-278",
        "anime": "Episodes 20-27 (Shippūden)"
      }
    ]
  },
  {
    "Kakuzu": [
      {
        "opponent": "Asuma Sarutobi",
        "result": "win",
        "summary": "Akatsuki Suppression arc. Kakuzu's multiple hearts and elemental combinations overwhelmed Asuma's Guardian Shinobi techniques.",
        "manga": "Chapters 323-328",
        "anime": "Episodes 78-80 (Shippūden)"
      },
      {
        "opponent": "Kakashi Hatake",
        "result": "draw",
        "summary": "Kakashi destroyed one heart with Lightning Blade but couldn't handle all five. Naruto arrived to finish the fight.",
        "manga": "Chapters 333-342",
        "anime": "Episodes 85-88 (Shippūden)"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "lose",
        "summary": "Naruto's Rasenshuriken destroyed two of Kakuzu's hearts simultaneously, and Kakashi finished him with Lightning Blade.",
        "manga": "Chapters 339-342",
        "anime": "Episodes 87-88 (Shippūden)"
      },
      {
        "opponent": "Hashirama Senju",
        "result": "lose",
        "summary": "Kakuzu was sent to assassinate the First Hokage but barely escaped alive, taking Hashirama's heart as his first extra heart.",
        "manga": "Chapter 334",
        "anime": "Episode 85 (Shippūden)"
      }
    ]
  },
  {
    "Hidan": [
      {
        "opponent": "Asuma Sarutobi",
        "result": "win",
        "summary": "Hidan used his Jashin ritual after ingesting Asuma's blood, creating a link to kill Asuma by stabbing himself.",
        "manga": "Chapters 323-328",
        "anime": "Episodes 78-80 (Shippūden)"
      },
      {
        "opponent": "Shikamaru Nara",
        "result": "lose",
        "summary": "Shikamaru separated Hidan from Kakuzu and trapped him with explosives, burying the immortal alive forever in the Nara forest.",
        "manga": "Chapters 333-339",
        "anime": "Episodes 85-87 (Shippūden)"
      },
      {
        "opponent": "Yugito Nii",
        "result": "win",
        "summary": "Hidan and Kakuzu captured the Two-Tails jinchūriki Yugito after a difficult battle where she transformed fully.",
        "manga": "Chapter 312",
        "anime": "Episode 71 (Shippūden)"
      }
    ]
  },
  {
    "Nagato": [
      {
        "opponent": "Jiraiya",
        "result": "win",
        "summary": "Jiraiya infiltrated Rain to investigate Pain. He killed three Paths but was overwhelmed by all six, dying after discovering Pain's secret.",
        "manga": "Chapters 369-383",
        "anime": "Episodes 127-133 (Shippūden)"
      },
      {
        "opponent": "Kakashi Hatake",
        "result": "win",
        "summary": "The Deva Path fought Kakashi during the Konoha invasion. Kakashi used Kamui but died from chakra exhaustion.",
        "manga": "Chapters 421-425",
        "anime": "Episodes 158-159 (Shippūden)"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "lose",
        "summary": "Naruto mastered Sage Mode and defeated all Six Paths, then convinced Nagato to believe in peace again. Nagato sacrificed himself to revive the dead.",
        "manga": "Chapters 430-449",
        "anime": "Episodes 163-175 (Shippūden)"
      },
      {
        "opponent": "Hinata Hyūga",
        "result": "win",
        "summary": "Hinata tried to protect Naruto and confessed her love, but Pain defeated her easily, triggering Naruto's Six-Tails transformation.",
        "manga": "Chapters 437-438",
        "anime": "Episode 166 (Shippūden)"
      },
      {
        "opponent": "Utakata",
        "result": "win",
        "summary": "Pain captured the Six-Tails jinchūriki Utakata for Akatsuki.",
        "manga": "Chapter 420",
        "anime": "Episodes 144-151 (Shippūden)"
      }
    ]
  },
  {
    "Konan": [
      {
        "opponent": "Jiraiya",
        "result": "win",
        "summary": "Konan fought alongside Nagato against their former teacher, helping to overwhelm the Sannin with the Six Paths.",
        "manga": "Chapters 369-375",
        "anime": "Episodes 127-130 (Shippūden)"
      },
      {
        "opponent": "Obito Uchiha",
        "result": "lose",
        "summary": "Konan prepared 600 billion paper bombs to kill Obito but he survived using Izanagi, then killed her to take Nagato's Rinnegan.",
        "manga": "Chapters 508-510",
        "anime": "Episodes 252-253 (Shippūden)"
      }
    ]
  },
  {
    "Obito Uchiha": [
      {
        "opponent": "Minato Namikaze",
        "result": "lose",
        "summary": "Nine-Tails attack on Konoha. Minato's Flying Thunder God outmaneuvered Obito's Kamui, hitting him with Rasengan and freeing Kurama.",
        "manga": "Chapters 501-504",
        "anime": "Episodes 248-249 (Shippūden)"
      },
      {
        "opponent": "Konan",
        "result": "win",
        "summary": "Obito survived Konan's 600 billion paper bomb ambush using Izanagi, then killed her and took Nagato's Rinnegan.",
        "manga": "Chapters 508-510",
        "anime": "Episodes 252-253 (Shippūden)"
      },
      {
        "opponent": "Yagura Karatachi",
        "result": "win",
        "summary": "Obito placed the Fourth Mizukage under genjutsu, controlling the Bloody Mist Village for years.",
        "manga": "Chapter 507",
        "anime": "Episode 251 (Shippūden)"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "lose",
        "summary": "Naruto's words and the Allied Forces broke Obito's will. He eventually abandoned the Eye of the Moon plan and helped seal Kaguya.",
        "manga": "Chapters 636-651",
        "anime": "Episodes 378-387 (Shippūden)"
      },
      {
        "opponent": "Kakashi Hatake",
        "result": "lose",
        "summary": "Former teammates battled in the Kamui dimension. Kakashi stabbed Obito, winning their emotional fight over ideals and the past.",
        "manga": "Chapters 608-609",
        "anime": "Episodes 375-376 (Shippūden)"
      }
    ]
  },
  {
    "Zabuza Momochi": [
      {
        "opponent": "Kakashi Hatake",
        "result": "lose",
        "summary": "Land of Waves. Kakashi's Sharingan copied Zabuza's techniques. In their final battle, Zabuza died killing Gato's men after Haku's death.",
        "manga": "Chapters 12-33",
        "anime": "Episodes 7-19"
      },
      {
        "opponent": "Haku",
        "result": "win",
        "summary": "Zabuza took Haku as his tool after finding him, training him in the art of killing. Haku died protecting Zabuza by choice.",
        "manga": "Chapters 29-32",
        "anime": "Episodes 17-19"
      }
    ]
  },
  {
    "Haku": [
      {
        "opponent": "Sasuke Uchiha",
        "result": "draw",
        "summary": "Haku's ice mirrors trapped Sasuke and Naruto. Sasuke awakened his Sharingan but was seemingly killed protecting Naruto.",
        "manga": "Chapters 27-31",
        "anime": "Episodes 17-19"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "draw",
        "summary": "Naruto's Nine-Tails chakra awakened and overwhelmed Haku, but Naruto couldn't bring himself to kill after seeing Haku's face.",
        "manga": "Chapters 27-31",
        "anime": "Episodes 17-19"
      },
      {
        "opponent": "Kakashi Hatake",
        "result": "lose",
        "summary": "Haku died by jumping in front of Kakashi's Lightning Blade meant for Zabuza, sacrificing himself for his master.",
        "manga": "Chapters 29-32",
        "anime": "Episodes 18-19"
      }
    ]
  },
  {
    "Kimimaro": [
      {
        "opponent": "Rock Lee",
        "result": "win",
        "summary": "Kimimaro's bone techniques overwhelmed the recovering Lee, who was still affected by his surgery and drunken fist wore off.",
        "manga": "Chapters 210-216",
        "anime": "Episodes 123-127"
      },
      {
        "opponent": "Gaara",
        "result": "lose",
        "summary": "Gaara's sand trapped Kimimaro underground. Kimimaro's illness killed him just as his bone spear was about to pierce Gaara's face.",
        "manga": "Chapters 214-217",
        "anime": "Episodes 126-127"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "win",
        "summary": "Kimimaro defeated Naruto before Lee arrived, protecting Sasuke's barrel during the retrieval mission.",
        "manga": "Chapters 210-212",
        "anime": "Episodes 123-124"
      }
    ]
  },
  {
    "Kidōmaru": [
      {
        "opponent": "Neji Hyūga",
        "result": "lose",
        "summary": "Kidōmaru analyzed Neji's Byakugan blind spot and nearly killed him with a guided arrow, but Neji struck his heart despite fatal wounds.",
        "manga": "Chapters 192-199",
        "anime": "Episodes 114-117"
      }
    ]
  },
  {
    "Tayuya": [
      {
        "opponent": "Shikamaru Nara",
        "result": "lose",
        "summary": "Shikamaru's Shadow Possession trapped Tayuya after clever strategy, but Temari arrived to deliver the killing blow.",
        "manga": "Chapters 203-207",
        "anime": "Episodes 119-121"
      },
      {
        "opponent": "Temari",
        "result": "lose",
        "summary": "Temari's Summoning: Quick Beheading Dance destroyed the forest and killed Tayuya, saving Shikamaru.",
        "manga": "Chapters 206-207",
        "anime": "Episode 121"
      }
    ]
  },
  {
    "Jirōbō": [
      {
        "opponent": "Choji Akimichi",
        "result": "lose",
        "summary": "Choji used the three Akimichi pills to achieve Butterfly Mode, killing Jirōbō with a massive Butterfly Bullet Bombing punch.",
        "manga": "Chapters 186-191",
        "anime": "Episodes 112-114"
      }
    ]
  },
  {
    "Sakon and Ukon": [
      {
        "opponent": "Kiba Inuzuka",
        "result": "win",
        "summary": "The twins' kekkei genkai nearly killed Kiba by merging into his body. Kiba and Akamaru were saved by Kankurō's arrival.",
        "manga": "Chapters 200-206",
        "anime": "Episodes 118-121"
      },
      {
        "opponent": "Kankurō",
        "result": "lose",
        "summary": "Kankurō's Black Ant puppet crushed Sakon and Ukon together, killing both twins in his iron maiden trap.",
        "manga": "Chapters 206-207",
        "anime": "Episode 121"
      }
    ]
  },
  {
    "Hiruzen Sarutobi": [
      {
        "opponent": "Orochimaru",
        "result": "lose",
        "summary": "The Third Hokage used Reaper Death Seal to steal Orochimaru's arms and soul, dying in the process during Konoha Crush.",
        "manga": "Chapters 120-138",
        "anime": "Episodes 71-80"
      }
    ]
  },
  {
    "Minato Namikaze": [
      {
        "opponent": "Obito Uchiha",
        "result": "win",
        "summary": "Minato used Flying Thunder God to outmaneuver Obito's Kamui, striking him with Rasengan and a contract seal to free Kurama.",
        "manga": "Chapters 501-504",
        "anime": "Episodes 248-249 (Shippūden)"
      },
      {
        "opponent": "A (Fourth Raikage)",
        "result": "draw",
        "summary": "Third Shinobi War encounter. A and B attacked Minato, but his Flying Thunder God teleportation was too fast even for A's speed.",
        "manga": "Chapter 541",
        "anime": "Episode 282 (Shippūden)"
      },
      {
        "opponent": "Killer B",
        "result": "draw",
        "summary": "Minato's Flying Thunder God placed a mark on B during their encounter, though no decisive winner emerged.",
        "manga": "Chapter 541",
        "anime": "Episode 282 (Shippūden)"
      }
    ]
  },
  {
    "Tobirama Senju": [
      {
        "opponent": "Madara Uchiha",
        "result": "draw",
        "summary": "Multiple battles during the Warring States period. Tobirama killed Izuna Uchiha but never definitively defeated Madara himself.",
        "manga": "Chapters 619-625",
        "anime": "Episodes 366-369 (Shippūden)"
      }
    ]
  },
  {
    "A (Fourth Raikage)": [
      {
        "opponent": "Sasuke Uchiha",
        "result": "draw",
        "summary": "Five Kage Summit. A lost his arm trying to break through Susanoo but was stopped by Gaara before killing Sasuke.",
        "manga": "Chapters 461-464",
        "anime": "Episodes 202-204 (Shippūden)"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "draw",
        "summary": "A tried to stop Naruto from joining the war. Naruto dodged his fastest punch using Nine-Tails Chakra Mode, proving his growth.",
        "manga": "Chapters 544-545",
        "anime": "Episodes 284-285 (Shippūden)"
      },
      {
        "opponent": "Minato Namikaze",
        "result": "draw",
        "summary": "Third Shinobi War. A and B fought Minato but couldn't land a hit on his Flying Thunder God speed.",
        "manga": "Chapter 541",
        "anime": "Episode 282 (Shippūden)"
      }
    ]
  },
  {
    "Killer B": [
      {
        "opponent": "Kisame Hoshigaki",
        "result": "win",
        "summary": "B decapitated Kisame with Lariat, though it was a clone. Later, B helped capture the real Kisame at the Falls of Truth.",
        "manga": "Chapters 470-473",
        "anime": "Episodes 206-207 (Shippūden)"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "draw",
        "summary": "B trained Naruto to control the Nine-Tails through intense sparring, with both pushing each other to new limits.",
        "manga": "Chapters 492-496",
        "anime": "Episodes 243-245 (Shippūden)"
      },
      {
        "opponent": "Sasuke Uchiha",
        "result": "win",
        "summary": "B overwhelmed Taka with Eight-Tails power, only pretending to be captured to escape from Kumo's responsibilities.",
        "manga": "Chapters 408-418",
        "anime": "Episodes 142-143 (Shippūden)"
      },
      {
        "opponent": "Minato Namikaze",
        "result": "draw",
        "summary": "Minato placed a Flying Thunder God mark on B during their Third Shinobi War encounter.",
        "manga": "Chapter 541",
        "anime": "Episode 282 (Shippūden)"
      }
    ]
  },
  {
    "Ōnoki": [
      {
        "opponent": "Mū",
        "result": "draw",
        "summary": "Fourth Shinobi War. Ōnoki fought his former master's Edo Tensei form, sealing him after a difficult battle.",
        "manga": "Chapters 553-556",
        "anime": "Episodes 300-303 (Shippūden)"
      },
      {
        "opponent": "Madara Uchiha",
        "result": "lose",
        "summary": "Five Kage were overwhelmed by Madara's Perfect Susanoo and Wood Clone army despite Ōnoki's Particle Style.",
        "manga": "Chapters 577-589",
        "anime": "Episodes 322-334 (Shippūden)"
      }
    ]
  },
  {
    "Mei Terumī": [
      {
        "opponent": "Sasuke Uchiha",
        "result": "draw",
        "summary": "Five Kage Summit. Mei's Lava and Boil Release techniques threatened Sasuke's Susanoo but the fight was interrupted.",
        "manga": "Chapters 464-466",
        "anime": "Episodes 204-205 (Shippūden)"
      },
      {
        "opponent": "Madara Uchiha",
        "result": "lose",
        "summary": "The Five Kage were defeated by Madara's overwhelming power despite their combined abilities.",
        "manga": "Chapters 577-589",
        "anime": "Episodes 322-334 (Shippūden)"
      }
    ]
  },
  {
    "Gengetsu Hōzuki": [
      {
        "opponent": "Gaara",
        "result": "draw",
        "summary": "Fourth Shinobi War. Gaara discovered the Second Mizukage's weakness and sealed him after an extended battle.",
        "manga": "Chapters 556-558",
        "anime": "Episodes 302-305 (Shippūden)"
      },
      {
        "opponent": "Ōnoki",
        "result": "draw",
        "summary": "Fourth Shinobi War. The Kage worked together to seal Edo Tensei Gengetsu.",
        "manga": "Chapters 556-558",
        "anime": "Episodes 302-305 (Shippūden)"
      }
    ]
  },
  {
    "Danzō Shimura": [
      {
        "opponent": "Sasuke Uchiha",
        "result": "lose",
        "summary": "Sasuke hunted Danzō for ordering the Uchiha massacre. After exhausting Izanagi, Danzō failed to take Sasuke with him.",
        "manga": "Chapters 476-481",
        "anime": "Episodes 209-211 (Shippūden)"
      },
      {
        "opponent": "Shisui Uchiha",
        "result": "win",
        "summary": "Danzō stole Shisui's eye to prevent him from using Kotoamatsukami, leading to Shisui's suicide and giving his other eye to Itachi.",
        "manga": "Chapter 550",
        "anime": "Episode 358 (Shippūden)"
      }
    ]
  },
  {
    "Kabuto Yakushi": [
      {
        "opponent": "Orochimaru",
        "result": "win",
        "summary": "Kabuto absorbed Orochimaru's remains and consciousness, integrating his powers and eventually becoming the dominant personality.",
        "manga": "Chapters 356-358",
        "anime": "Episodes 113-115 (Shippūden)"
      },
      {
        "opponent": "Tsunade",
        "result": "lose",
        "summary": "Kabuto's regeneration abilities couldn't overcome Tsunade's medical knowledge and superhuman strength.",
        "manga": "Chapters 163-170",
        "anime": "Episodes 94-96"
      },
      {
        "opponent": "Itachi Uchiha",
        "result": "lose",
        "summary": "Edo Tensei Itachi trapped Kabuto in Izanami, forcing him to release the reanimation jutsu and accept his true self.",
        "manga": "Chapters 579-588",
        "anime": "Episodes 333-339 (Shippūden)"
      },
      {
        "opponent": "Sasuke Uchiha",
        "result": "lose",
        "summary": "Sasuke and Itachi worked together to defeat Kabuto's Sage Mode, with Itachi ultimately sealing him.",
        "manga": "Chapters 579-588",
        "anime": "Episodes 333-339 (Shippūden)"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "draw",
        "summary": "Their battles left both damaged but alive. Naruto's Rasengan hit Kabuto but his regeneration saved him.",
        "manga": "Chapters 166-170",
        "anime": "Episodes 94-96"
      },
      {
        "opponent": "Yamato",
        "result": "draw",
        "summary": "Encounters where neither achieved decisive victory in direct combat.",
        "manga": "Various chapters",
        "anime": "Various episodes"
      }
    ]
  },
  {
    "Chiyo": [
      {
        "opponent": "Sasori",
        "result": "win",
        "summary": "Chiyo and Sakura destroyed Sasori's puppet body. Chiyo used her knowledge of his techniques, and Sasori chose not to dodge the final blow.",
        "manga": "Chapters 264-278",
        "anime": "Episodes 20-27 (Shippūden)"
      }
    ]
  },
  {
    "Anko Mitarashi": [
      {
        "opponent": "Orochimaru",
        "result": "lose",
        "summary": "Orochimaru easily defeated his former student during the Chūnin Exams, her Curse Mark being a pale shadow of his power.",
        "manga": "Chapters 49-51",
        "anime": "Episodes 29-30"
      },
      {
        "opponent": "Kabuto Yakushi",
        "result": "draw",
        "summary": "Kabuto captured Anko for her Curse Mark during the Fourth Shinobi War, using her to strengthen the Edo Tensei.",
        "manga": "Chapter 515",
        "anime": "Episode 261 (Shippūden)"
      }
    ]
  },
  {
    "Temari": [
      {
        "opponent": "Tenten",
        "result": "win",
        "summary": "Chūnin Exams preliminaries. Temari's wind techniques completely nullified Tenten's weapons, winning without any difficulty.",
        "manga": "Chapter 73",
        "anime": "Episode 43"
      },
      {
        "opponent": "Shikamaru Nara",
        "result": "win",
        "summary": "Chūnin Exams finals. Shikamaru strategically outplayed Temari but forfeited due to chakra exhaustion despite winning position.",
        "manga": "Chapters 107-108",
        "anime": "Episode 64"
      },
      {
        "opponent": "Tayuya",
        "result": "win",
        "summary": "Temari arrived to save Shikamaru, using Summoning: Quick Beheading Dance to destroy the forest and kill Tayuya.",
        "manga": "Chapters 206-207",
        "anime": "Episode 121"
      }
    ]
  },
  {
    "Kankurō": [
      {
        "opponent": "Shino Aburame",
        "result": "lose",
        "summary": "Chūnin Exams. Kankurō forfeited when Shino's bugs had already infiltrated his puppets and body, fearing being consumed.",
        "manga": "Chapter 125",
        "anime": "Episode 75"
      },
      {
        "opponent": "Sasori",
        "result": "lose",
        "summary": "Kankurō was easily defeated and poisoned by his puppet predecessor during the Gaara rescue arc.",
        "manga": "Chapters 253-256",
        "anime": "Episodes 6-8 (Shippūden)"
      },
      {
        "opponent": "Sakon and Ukon",
        "result": "win",
        "summary": "Kankurō's Black Ant puppet crushed the twin brothers, saving Kiba and Akamaru from certain death.",
        "manga": "Chapters 206-207",
        "anime": "Episode 121"
      }
    ]
  },
  {
    "Madara Uchiha": [
      {
        "opponent": "Hashirama Senju",
        "result": "lose",
        "summary": "Final Valley. Hashirama killed Madara in their legendary battle, though Madara had prepared for resurrection using Izanagi.",
        "manga": "Chapters 619-626",
        "anime": "Episodes 366-370 (Shippūden)"
      },
      {
        "opponent": "Might Guy",
        "result": "lose",
        "summary": "Guy opened all Eight Gates and nearly killed Madara with Night Guy. Madara called him the strongest taijutsu user ever.",
        "manga": "Chapters 668-672",
        "anime": "Episodes 418-420 (Shippūden)"
      },
      {
        "opponent": "Naruto Uzumaki",
        "result": "lose",
        "summary": "Naruto with Six Paths Sage Mode fought Madara, who ultimately became the vessel for Kaguya's resurrection.",
        "manga": "Chapters 673-678",
        "anime": "Episodes 420-458 (Shippūden)"
      },
      {
        "opponent": "Tobirama Senju",
        "result": "draw",
        "summary": "Multiple battles during the Warring States period. Tobirama killed Izuna but never defeated Madara himself.",
        "manga": "Chapters 619-625",
        "anime": "Episodes 366-369 (Shippūden)"
      }
    ]
  },
  {
    "Hashirama Senju": [
      {
        "opponent": "Madara Uchiha",
        "result": "win",
        "summary": "Final Valley. Hashirama's Wood Release and Sage Mode defeated Madara and Kurama, establishing Konoha's dominance.",
        "manga": "Chapters 619-626",
        "anime": "Episodes 366-370 (Shippūden)"
      },
      {
        "opponent": "Kakuzu",
        "result": "win",
        "summary": "Kakuzu was sent to assassinate Hashirama but barely escaped alive, taking Hashirama's heart to survive.",
        "manga": "Chapter 334",
        "anime": "Episode 85 (Shippūden)"
      }
    ]
  },
  {
    "Kaguya Ōtsutsuki": [
      {
        "opponent": "Naruto Uzumaki",
        "result": "lose",
        "summary": "Naruto and Sasuke sealed Kaguya with Six Paths — Chibaku Tensei after an extended battle across dimensions.",
        "manga": "Chapters 679-690",
        "anime": "Episodes 458-479 (Shippūden)"
      },
      {
        "opponent": "Sasuke Uchiha",
        "result": "lose",
        "summary": "Sasuke's Rinnegan dimension-shifting was crucial to cornering Kaguya for the final seal alongside Naruto.",
        "manga": "Chapters 679-690",
        "anime": "Episodes 458-479 (Shippūden)"
      }
    ]
  },
  {
    "Mū": [
      {
        "opponent": "Ōnoki",
        "result": "draw",
        "summary": "Fourth Shinobi War. Ōnoki sealed his former master after exploiting the weakness of his fission technique.",
        "manga": "Chapters 553-556",
        "anime": "Episodes 300-303 (Shippūden)"
      },
      {
        "opponent": "Gaara",
        "result": "draw",
        "summary": "Gaara and the Allied Forces worked together to seal the Second Tsuchikage during the war.",
        "manga": "Chapters 553-556",
        "anime": "Episodes 300-303 (Shippūden)"
      }
    ]
  },
  {
    "A (Third Raikage)": [
      {
        "opponent": "Naruto Uzumaki",
        "result": "lose",
        "summary": "Naruto used Sage Mode to redirect the Third Raikage's Hell Stab into his own body, exploiting the scar on his chest.",
        "manga": "Chapters 553-555",
        "anime": "Episodes 301-302 (Shippūden)"
      }
    ]
  },
  {
    "Rasa": [
      {
        "opponent": "Orochimaru",
        "result": "lose",
        "summary": "Orochimaru killed the Fourth Kazekage and impersonated him to manipulate Sand Village into attacking Konoha.",
        "manga": "Chapter 129",
        "anime": "Episode 76"
      }
    ]
  },
  {
    "Fugaku Uchiha": [
      {
        "opponent": "Itachi Uchiha",
        "result": "lose",
        "summary": "Fugaku allowed Itachi to kill him and his wife during the Uchiha massacre, accepting his son's painful choice.",
        "manga": "Chapter 590",
        "anime": "Episode 455 (Shippūden)"
      }
    ]
  },
  {
    "Shisui Uchiha": [
      {
        "opponent": "Danzō Shimura",
        "result": "lose",
        "summary": "Danzō stole Shisui's right eye to prevent Kotoamatsukami. Shisui gave his left eye to Itachi and committed suicide.",
        "manga": "Chapter 550",
        "anime": "Episode 358 (Shippūden)"
      }
    ]
  },
  {
    "Yagura Karatachi": [
      {
        "opponent": "Obito Uchiha",
        "result": "lose",
        "summary": "Obito placed the Fourth Mizukage under his genjutsu, using him to control the Bloody Mist Village for years.",
        "manga": "Chapter 507",
        "anime": "Episode 251 (Shippūden)"
      }
    ]
  },
  {
    "Utakata": [
      {
        "opponent": "Nagato",
        "result": "lose",
        "summary": "Pain captured the Six-Tails jinchūriki Utakata for Akatsuki's Ten-Tails revival plan.",
        "manga": "Chapter 420",
        "anime": "Episodes 144-151 (Shippūden)"
      }
    ]
  },
  {
    "Yugito Nii": [
      {
        "opponent": "Hidan",
        "result": "lose",
        "summary": "Hidan and Kakuzu captured the Two-Tails jinchūriki after a difficult fight where Yugito fully transformed.",
        "manga": "Chapter 312",
        "anime": "Episode 71 (Shippūden)"
      }
    ]
  },
  {
    "Rōshi": [
      {
        "opponent": "Kisame Hoshigaki",
        "result": "lose",
        "summary": "Kisame captured the Four-Tails jinchūriki Rōshi for Akatsuki, overwhelming his Lava Release with Samehada.",
        "manga": "Chapter 353",
        "anime": "Episode 121 (Shippūden)"
      }
    ]
  },
  {
    "Han": [
      {
        "opponent": "Deidara",
        "result": "lose",
        "summary": "Deidara captured the Five-Tails jinchūriki Han for Akatsuki using his explosive clay techniques.",
        "manga": "Chapter 420",
        "anime": "N/A (mentioned only)"
      }
    ]
  },
  {
    "Fū": [
      {
        "opponent": "Hidan",
        "result": "lose",
        "summary": "The Seven-Tails jinchūriki Fū was captured by Akatsuki. The exact battle details were not shown.",
        "manga": "Chapter 420",
        "anime": "N/A (mentioned only)"
      }
    ]
  },
  {
    "Hanzō": [
      {
        "opponent": "Jiraiya",
        "result": "draw",
        "summary": "Second Shinobi War. The Sannin survived against Hanzō, who was so impressed he spared them and gave them their title.",
        "manga": "Chapter 369",
        "anime": "Episode 128 (Shippūden)"
      }
    ]
  }
]
